/*
7*7 격자판 미로를 탈출하는 경로의 가지수를 출력하는 프로그램을 작성하세요. 출발점은 격 자의 (1, 1) 좌표이고, 탈출 도착점은 (7, 7)좌표이다. 격자판의 1은 벽이고, 0은 통로이다. 격 자판의 움직임은 상하좌우로만 움직인다. 미로가 다음과 같다면
위의 지도에서 출발점에서 도착점까지 갈 수 있는 방법의 수는 8가지이다.
▣ 입력설명
7*7 격자판의 정보가 주어집니다.
▣ 출력설명
첫 번째 줄에 경로의 가지수를 출력한다.
 */

// 굳이 체크배열 안 만들어도 될듯

function solution(arr) {
  let answer = 0;
  arr[0][0] = 1;

  function dfs(vx, vy) {
    if (vx === 6 && vy === 6) {
      answer++;
      return;
    }
    for (let [a, b] of [
      [1, 0],
      [-1, 0],
      [0, 1],
      [0, -1],
    ]) {
      let x = vx + a,
        y = vy + b;
      if (x < 0 || y < 0 || x > 6 || y > 6) continue; // 범위 넘으면 안돼
      if (arr[x][y] === 1) continue; // 벽이 있거나 갔던 길 가면 안돼
      arr[x][y] = 1;
      dfs(x, y);
      arr[x][y] = 0;
    }
  }
  dfs(0, 0);
  return answer;
}

let arr = [
  [0, 0, 0, 0, 0, 0, 0],
  [0, 1, 1, 1, 1, 1, 0],
  [0, 0, 0, 1, 0, 0, 0],
  [1, 1, 0, 1, 0, 1, 1],
  [1, 1, 0, 0, 0, 0, 1],
  [1, 1, 0, 1, 1, 0, 0],
  [1, 0, 0, 0, 0, 0, 0],
];

console.log(solution(arr));
